/*
const numbers = [5, 8, -1, '-6', 11, 'ololo', '-2']
let sum = 0
for (let i = 0; i < numbers.length; i++) {
  sum += numbers[i]
}

alert('Sum is ' + sum)

1. Оголосити numbers.

2. Присвоїти numbers масив з 7 елементів: [5, 8, -1, '-6', 11, 'ololo', '-2'].

3. Оголосити sum.

4. Присвоїти sum 0.

5. Оголосити i.

6. Присвоїти i 0.

7. Перевірити, чи i менше довжини масиву: 0 < 7 - так.

8. Присвоїти sum попереднє значення плюс 0-й елемент масиву: sum = 0 + 5 = 5.

9. Збільшити i на одиницю: i = 1.

10. Перевірити, чи i менше довжини масиву: 1 < 7 - так.

11. Присвоїти sum попереднє значення плюс 1-й елемент масиву: sum = 5 + 8 = 13.

12. Збільшити i на одиницю: i = 2.

13. Перевірити, чи i менше довжини масиву: 2 < 7 - так.

14. Присвоїти sum попереднє значення плюс 2-й елемент масиву: sum = 13 + (-1) = 12.

15. Збільшити i на одиницю: i = 3.

16. Перевірити, чи i менше довжини масиву: 3 < 7 - так.

17. Присвоїти sum попереднє значення плюс 3-й елемент масиву: sum = 12 + '-6' = '12-6'.

18. Збільшити i на одиницю: i = 4.

19. Перевірити, чи i менше довжини масиву: 4 < 7 - так.

20. Присвоїти sum попереднє значення плюс 4-й елемент масиву: '12-6' + 11 = '12-611'.

21. Збільшити i на одиницю: i = 5.

22. Перевірити, чи i менше довжини масиву: 5 < 7 - так.

23. Присвоїти sum попереднє значення плюс 5-й елемент масиву: '12-611' + 'ololo' = '12-611ololo'.

24. Збільшити i на одиницю: i = 6.

25. Перевірити, чи i менше довжини масиву: 6 < 7 - так.

26. Присвоїти sum попереднє значення плюс 6-й елемент масиву: '12-611ololo' + '-2' = '12-611ololo-2'.

27. Збільшити i на одиницю: i = 7.

28. Перевірити, чи i менше довжини масиву: 7 < 7 - ні.

29. Вивести повідомлення "Sum is 12-611ololo-2".
*/

const numbers = [5, 8, -1, '-6', 11, 'ololo', '-2'];
let sum = 0;

for (let i = 0; i < numbers.length; i++) {
  let num = parseInt(numbers[i]);

  if (!isNaN(num)) {
    sum += num;
  }
}

alert('Sum is ' + sum);
